app/controllers/site_controller.rb

SELECT * FROM `players` WHERE (`players`.`name` = 'todd' AND `players`.`password` = 'pass') LIMIT 1
---
  def login
    if request.post?
      player = Player.find_by_name_and_password params[:player][:name], params[:player][:password]

SELECT * FROM `players` WHERE (`players`.`id` = 2)
SELECT * FROM `games` WHERE (`games`.player_id = 2) LIMIT 1
---
  def play
    player = Player.find session[:id]
    @player_name = player.name

    opponent = Player.find player.game.opponent_id

SELECT * FROM `players` WHERE (`players`.`id` = 10)
SELECT * FROM `players` ORDER BY score DESC
SELECT * FROM `players` ORDER BY score DESC LIMIT 5
---
  def scoreboard
    @players = Player.find( :all, :order => "score DESC", :limit => 5 )
    @player = Player.find session[:id]

    unless @players.include? @player

SELECT * FROM `players` WHERE (`players`.`id` = 1)
SELECT * FROM `games` WHERE (`games`.`is_waiting` = 1) LIMIT 1
---
  def waiting
    player = Player.find session[:id]
    player_game = player.game

    # prevent player from being own opponent
    player_game.is_waiting = false
    player_game.player_weapon_id = nil
    player_game.opponent_weapon = nil
    player_game.save

    opponent_game = Game.find_by_is_waiting true