app/controllers/site_controller.rb

INSERT INTO `players` (`name`, `password`, `score`, `created_at`, `updated_at`) VALUES('Ruby', 'Rails', 0, '2011-10-12 01:16:43', '2011-10-12 01:16:43')
INSERT INTO `games` (`player_id`, `opponent_id`, `player_weapon_id`, `opponent_weapon_id`, `is_waiting`) VALUES(NULL, NULL, NULL, NULL, 0)
---
  def register
    if request.post?
      player = Player.new params[:player]
      if player.save(true)
        player.game = Game.create

UPDATE `games` SET `opponent_id` = 664089248, `is_waiting` = 0 WHERE `id` = 670108558
---
  def waiting
    player = Player.find session[:id]
    player_game = player.game

    # prevent player from being own opponent
    player_game.is_waiting = false
    player_game.player_weapon_id = nil
    player_game.opponent_weapon = nil
    player_game.save